#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
Running plan in Terraform Cloud. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/DevOpsKats/AWSDevOpsKats/runs/run-r7Age4R9czn7vyNn

Waiting for the plan to start...

Terraform v1.1.5
on linux_amd64
Configuring remote state backend...
Initializing Terraform configuration...
module.package_in_docker.local_file.archive_plan[0]: Refreshing state... [id=d907be14cb3b1ebad817301c218e92cfb3605d27]
module.package_in_docker.null_resource.archive[0]: Refreshing state... [id=3982948028235208403]
aws_cloudwatch_event_rule.hourly: Refreshing state... [id=auto-remove-ecs-service-hourly]
aws_efs_file_system.develop: Refreshing state... [id=fs-0aff87e0b7aa5d986]
module.ecs[0].module.ecs.aws_ecs_cluster.this[0]: Refreshing state... [id=arn:aws:ecs:us-east-1:816939196156:cluster/develop-devops]
module.ecs[0].aws_cloudwatch_log_group.this: Refreshing state... [id=devopskats-develop]
aws_ssm_parameter.develop_smtp_username: Refreshing state... [id=/devopskats/develop/smtp/username]
aws_iam_role.ecs_task_execution_role: Refreshing state... [id=devopskats-ecsTaskExecutionRole]
module.ecs[1].module.ecs.aws_ecs_cluster.this[0]: Refreshing state... [id=arn:aws:ecs:us-east-1:816939196156:cluster/master-devops]
aws_ssm_parameter.master_smtp_server: Refreshing state... [id=/devopskats/master/smtp/server]
module.ecs[1].aws_cloudwatch_log_group.this: Refreshing state... [id=devopskats-master]
aws_ssm_parameter.develop_smtp_server: Refreshing state... [id=/devopskats/develop/smtp/server]
aws_ssm_parameter.master_smtp_username: Refreshing state... [id=/devopskats/master/smtp/username]
aws_iam_role.container: Refreshing state... [id=devopskats-container]
aws_ssm_parameter.master_smtp_password: Refreshing state... [id=/devopskats/master/smtp/password]
module.deploy_group.aws_iam_group.this[0]: Refreshing state... [id=deploy_group]
aws_efs_file_system.master: Refreshing state... [id=fs-076d94d6dcf153360]
aws_ssm_parameter.master_smtp_port: Refreshing state... [id=/devopskats/master/smtp/port]
aws_ssm_parameter.develop_smtp_password: Refreshing state... [id=/devopskats/develop/smtp/password]
aws_ssm_parameter.develop_smtp_port: Refreshing state... [id=/devopskats/develop/smtp/port]
aws_iam_role.deploy_user: Refreshing state... [id=devopskats-deploy]
module.deploy_user.aws_iam_user.this[0]: Refreshing state... [id=giithub-action-deploy-ecs-deploy]
module.deploy_group.aws_iam_group_membership.this[0]: Refreshing state... [id=deploy_group]
module.deploy_user.aws_iam_access_key.this_no_pgp[0]: Refreshing state... [id=AKIA34NK6336CJPVCROP]
module.lambda_function.aws_iam_policy_attachment.logs[0]: Refreshing state... [id=auto-remove-ecs-service-logs]
module.lambda_function.aws_iam_policy_attachment.additional_inline[0]: Refreshing state... [id=auto-remove-ecs-service]
aws_security_group.jumpbox: Refreshing state... [id=sg-074c96b91925be2cf]
aws_security_group.ecs_tasks: Refreshing state... [id=sg-0b2c5b7733dcb6be0]
aws_security_group.master_alb: Refreshing state... [id=sg-006eb0a46ccafcde5]
module.alb_master.aws_lb_target_group.this: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-1:816939196156:targetgroup/master-devops/a5b3cd28f05e4bba]
module.lambda_function.aws_cloudwatch_log_group.lambda[0]: Refreshing state... [id=/aws/lambda/auto-remove-ecs-service]
module.lambda_function.aws_iam_policy.additional_inline[0]: Refreshing state... [id=arn:aws:iam::816939196156:policy/auto-remove-ecs-service-inline]
aws_iam_role_policy.agent: Refreshing state... [id=devopskats-ecsTaskExecutionRole:devopskats-agent]
aws_iam_role_policy_attachment.ecs-task-execution-role-policy-attachment: Refreshing state... [id=devopskats-ecsTaskExecutionRole-20220105111606494100000001]
module.lambda_function.aws_iam_role.lambda[0]: Refreshing state... [id=auto-remove-ecs-service]
module.ec2_instance.aws_instance.this[0]: Refreshing state... [id=i-01f482542822e55b7]
aws_security_group.master_ecs_tasks: Refreshing state... [id=sg-0803c5dd7fca09fbd]
aws_iam_role_policy.container: Refreshing state... [id=devopskats-container:devopskats-container]
module.alb_master.aws_lb.this: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-1:816939196156:loadbalancer/app/master-devops/7625e8fab2cee400]
module.ecs[1].aws_ecs_task_definition.this: Refreshing state... [id=master-devops]
module.ecs[0].aws_ecs_task_definition.this: Refreshing state... [id=develop-devops]
module.lambda_function.aws_iam_policy.logs[0]: Refreshing state... [id=arn:aws:iam::816939196156:policy/auto-remove-ecs-service-logs]
module.deploy_group.aws_iam_policy.custom[0]: Refreshing state... [id=arn:aws:iam::816939196156:policy/AllowECSDeployment]
aws_security_group.efs: Refreshing state... [id=sg-0f5cfb59e8209a95e]
module.deploy_group.aws_iam_group_policy_attachment.custom[0]: Refreshing state... [id=deploy_group-20220103151548477200000002]
aws_efs_mount_target.develop: Refreshing state... [id=fsmt-004d71ec0703b583f]
aws_efs_mount_target.master: Refreshing state... [id=fsmt-059154582db2f67c2]
module.alb_master.aws_lb_listener.http_forward[0]: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-1:816939196156:listener/app/master-devops/7625e8fab2cee400/6a93459ad783558d]
module.lambda_function.aws_lambda_function.this[0]: Refreshing state... [id=auto-remove-ecs-service]
module.lambda_function.aws_lambda_permission.unqualified_alias_triggers["OneRule"]: Refreshing state... [id=OneRule]
aws_cloudwatch_event_target.lambda_function: Refreshing state... [id=auto-remove-ecs-service-hourly-terraform-20220116110946217000000001]
aws_eip.jumpbox: Refreshing state... [id=eipalloc-041e26d8b75a8767e]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply":

  # module.package_in_docker.local_file.archive_plan[0] has been deleted
  - resource "local_file" "archive_plan" {
      - content              = jsonencode(
            {
              - artifacts_dir = "builds"
              - build_plan    = [
                  - [
                      - "zip",
                      - "./function/lambda_function.py",
                      - null,
                    ],
                  - [
                      - "pip",
                      - "python3",
                      - "./function/requirements.txt",
                      - null,
                    ],
                ]
              - filename      = "builds/30277984fb823f27c072316db423dbc92c64bfbaa2111ab92dddeff74bed6dfe.zip"
              - runtime       = "python3"
            }
        ) -> null
      - directory_permission = "0755" -> null
      - file_permission      = "0644" -> null
      - filename             = "builds/30277984fb823f27c072316db423dbc92c64bfbaa2111ab92dddeff74bed6dfe.plan.json" -> null
      - id                   = "d907be14cb3b1ebad817301c218e92cfb3605d27" -> null
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
  - destroy
-/+ destroy and then create replacement
 <= read (data resources)

Terraform will perform the following actions:

  # module.lambda_function.data.aws_iam_policy_document.additional_inline[0] will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "additional_inline"  {
      ~ id      = "1861255451" -> (known after apply)
      ~ json    = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = [
                          - "ecs:UpdateService",
                          - "ecs:List*",
                          - "ecs:Describe*",
                        ]
                      - Effect   = "Allow"
                      - Resource = "*"
                      - Sid      = "ecsdeleteservice"
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
      - version = "2012-10-17" -> null

      ~ statement {
          - not_actions   = [] -> null
          - not_resources = [] -> null
            # (4 unchanged attributes hidden)
        }
    }

  # module.lambda_function.data.aws_iam_policy_document.assume_role[0] will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "assume_role"  {
      ~ id      = "3693445097" -> (known after apply)
      ~ json    = jsonencode(
            {
              - Statement = [
                  - {
                      - Action    = "sts:AssumeRole"
                      - Effect    = "Allow"
                      - Principal = {
                          - Service = "lambda.amazonaws.com"
                        }
                      - Sid       = ""
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
      - version = "2012-10-17" -> null

      ~ statement {
          - not_actions   = [] -> null
          - not_resources = [] -> null
          - resources     = [] -> null
            # (2 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }
    }

  # module.lambda_function.data.aws_iam_policy_document.logs[0] will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "logs"  {
      ~ id      = "3263443194" -> (known after apply)
      ~ json    = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = [
                          - "logs:PutLogEvents",
                          - "logs:CreateLogStream",
                          - "logs:CreateLogGroup",
                        ]
                      - Effect   = "Allow"
                      - Resource = [
                          - "arn:aws:logs:us-east-1:816939196156:log-group:/aws/lambda/auto-remove-ecs-service:*:*",
                          - "arn:aws:logs:us-east-1:816939196156:log-group:/aws/lambda/auto-remove-ecs-service:*",
                        ]
                      - Sid      = ""
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
      - version = "2012-10-17" -> null

      ~ statement {
          - not_actions   = [] -> null
          - not_resources = [] -> null
            # (3 unchanged attributes hidden)
        }
    }

  # module.lambda_function.data.aws_partition.current will be read during apply
  # (config refers to values not yet known)
 <= data "aws_partition" "current"  {
      + dns_suffix         = (known after apply)
      + id                 = (known after apply)
      + partition          = (known after apply)
      + reverse_dns_prefix = (known after apply)
    }

  # module.lambda_function.aws_iam_policy.additional_inline[0] will be updated in-place
  ~ resource "aws_iam_policy" "additional_inline" {
        id        = "arn:aws:iam::816939196156:policy/auto-remove-ecs-service-inline"
        name      = "auto-remove-ecs-service-inline"
      ~ policy    = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = [
                          - "ecs:UpdateService",
                          - "ecs:List*",
                          - "ecs:Describe*",
                        ]
                      - Effect   = "Allow"
                      - Resource = "*"
                      - Sid      = "ecsdeleteservice"
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
        tags      = {
            "Env" = "develop"
        }
        # (4 unchanged attributes hidden)
    }

  # module.lambda_function.aws_iam_policy.logs[0] will be updated in-place
  ~ resource "aws_iam_policy" "logs" {
        id        = "arn:aws:iam::816939196156:policy/auto-remove-ecs-service-logs"
        name      = "auto-remove-ecs-service-logs"
      ~ policy    = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = [
                          - "logs:PutLogEvents",
                          - "logs:CreateLogStream",
                          - "logs:CreateLogGroup",
                        ]
                      - Effect   = "Allow"
                      - Resource = [
                          - "arn:aws:logs:us-east-1:816939196156:log-group:/aws/lambda/auto-remove-ecs-service:*:*",
                          - "arn:aws:logs:us-east-1:816939196156:log-group:/aws/lambda/auto-remove-ecs-service:*",
                        ]
                      - Sid      = ""
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
        tags      = {
            "Env" = "develop"
        }
        # (4 unchanged attributes hidden)
    }

  # module.lambda_function.aws_iam_policy_attachment.additional_inline[0] will be destroyed
  # (because aws_iam_policy_attachment.additional_inline is not in configuration)
  - resource "aws_iam_policy_attachment" "additional_inline" {
      - groups     = [] -> null
      - id         = "auto-remove-ecs-service" -> null
      - name       = "auto-remove-ecs-service" -> null
      - policy_arn = "arn:aws:iam::816939196156:policy/auto-remove-ecs-service-inline" -> null
      - roles      = [
          - "auto-remove-ecs-service",
        ] -> null
      - users      = [] -> null
    }

  # module.lambda_function.aws_iam_policy_attachment.logs[0] will be destroyed
  # (because aws_iam_policy_attachment.logs is not in configuration)
  - resource "aws_iam_policy_attachment" "logs" {
      - groups     = [] -> null
      - id         = "auto-remove-ecs-service-logs" -> null
      - name       = "auto-remove-ecs-service-logs" -> null
      - policy_arn = "arn:aws:iam::816939196156:policy/auto-remove-ecs-service-logs" -> null
      - roles      = [
          - "auto-remove-ecs-service",
        ] -> null
      - users      = [] -> null
    }

  # module.lambda_function.aws_iam_role.lambda[0] will be updated in-place
  ~ resource "aws_iam_role" "lambda" {
      ~ assume_role_policy    = jsonencode(
            {
              - Statement = [
                  - {
                      - Action    = "sts:AssumeRole"
                      - Effect    = "Allow"
                      - Principal = {
                          - Service = "lambda.amazonaws.com"
                        }
                      - Sid       = ""
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
        id                    = "auto-remove-ecs-service"
        name                  = "auto-remove-ecs-service"
      ~ tags                  = {
          + "Env" = "develop"
        }
      ~ tags_all              = {
          + "Env"         = "develop"
            # (3 unchanged elements hidden)
        }
        # (7 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.lambda_function.aws_iam_role_policy_attachment.additional_inline[0] will be created
  + resource "aws_iam_role_policy_attachment" "additional_inline" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::816939196156:policy/auto-remove-ecs-service-inline"
      + role       = "auto-remove-ecs-service"
    }

  # module.lambda_function.aws_iam_role_policy_attachment.logs[0] will be created
  + resource "aws_iam_role_policy_attachment" "logs" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::816939196156:policy/auto-remove-ecs-service-logs"
      + role       = "auto-remove-ecs-service"
    }

  # module.lambda_function.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
      ~ filename                       = "builds/e0ca09d0594d68b0b1dfbfe218a737acc0d9b5885d84607a4f9ad0c31386e7fe.zip" -> "builds/f00af33e03c3617a1ba03904cbe781bf36a39ab1f2e9338f217eac26d0c9d018.zip"
        id                             = "auto-remove-ecs-service"
      ~ last_modified                  = "2022-01-26T14:26:14.000+0000" -> (known after apply)
        tags                           = {
            "Env" = "develop"
        }
        # (18 unchanged attributes hidden)


        # (2 unchanged blocks hidden)
    }

  # module.package_in_docker.local_file.archive_plan[0] will be created
  + resource "local_file" "archive_plan" {
      + content              = jsonencode(
            {
              + artifacts_dir = "builds"
              + build_plan    = [
                  + [
                      + "zip",
                      + "./function/lambda_function.py",
                      + null,
                    ],
                  + [
                      + "pip",
                      + "python3",
                      + "./function/requirements.txt",
                      + null,
                      + null,
                    ],
                ]
              + filename      = "builds/f00af33e03c3617a1ba03904cbe781bf36a39ab1f2e9338f217eac26d0c9d018.zip"
              + runtime       = "python3"
            }
        )
      + directory_permission = "0755"
      + file_permission      = "0644"
      + filename             = "builds/f00af33e03c3617a1ba03904cbe781bf36a39ab1f2e9338f217eac26d0c9d018.plan.json"
      + id                   = (known after apply)
    }

  # module.package_in_docker.null_resource.archive[0] must be replaced
-/+ resource "null_resource" "archive" {
      ~ id       = "3982948028235208403" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "filename"  = "builds/30277984fb823f27c072316db423dbc92c64bfbaa2111ab92dddeff74bed6dfe.zip" -> "builds/f00af33e03c3617a1ba03904cbe781bf36a39ab1f2e9338f217eac26d0c9d018.zip"
          ~ "timestamp" = "1644422720932324800" -> "1644422988001019000"
        }
    }

Plan: 4 to add, 4 to change, 3 to destroy.


```

</details>

*Pusher: @chiplonton, Action: `pull_request`*